app/views/articles/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 9]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 9]]
---
          </li>
          <li><smal><%= pluralize(@article.user.articles.count, "article") if @article.user.articles %></smal></li>