app/views/users/index.html.erb

SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]
---
          </li>
          <li><smal><%= pluralize(user.articles.count, "article") if user.articles %></smal></li>