app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
  def index
    @articles = Article.paginate(page: params[:page], per_page: 5)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 10]]
SELECT "articles".* FROM "articles"
INSERT INTO "articles" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "title of article"], ["description", "body of article to test user"], ["user_id", 2], ["created_at", "2017-01-09 07:21:57.181116"], ["updated_at", "2017-01-09 07:21:57.181116"]]
---
  def create
    # debugger
    @article = Article.new(article_params)
    @article.user = User.first
    if @article.save

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Questo è il mio articolo edited"], ["description", "La mia  descrizione su questo articolo edited"], ["updated_at", "2016-12-29 19:47:35.219969"], ["id", 11]]
---
  def update
    if @article.update(article_params)