app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], per_page: 5)
---
SELECT  "users".* FROM "users" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "username" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "Fulvio3"], ["email", "fulvio3@gmail.com"], ["updated_at", "2017-01-15 16:15:53.714392"], ["id", 7]]

  def show
    @user_articles = @user.articles.paginate(page: params[:page], per_page: 5)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT 5 OFFSET 0  [["user_id", 9]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 9]]